Revit 2027 API
BuiltInFailures.RebarShapeFailures.DimensionWithCommonLengthUnit Property
 A shape dimension is labelled with a parameter that uses the Common Length unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionWithCommonLengthUnit { get; }
Public Shared ReadOnly Property DimensionWithCommonLengthUnit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionWithCommonLengthUnit {
	FailureDefinitionId^ get ();
}
static member DimensionWithCommonLengthUnit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace